app/views/index/index.html.erb


<%Gossip.all.each do |gossip|%>
---
SELECT "gossips".* FROM "gossips"

        <h3 class="title"><%=gossip.title%></h3>
        <p><%=User.all.find_by(id: gossip.user_id).first_name%> <%=User.all.find_by(id: gossip.user_id).last_name%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]